Repository: EolaneTallinn/SPCReporter
Catalog: SPCReportingTool/Resources/String.*.resx
Languages: ru

# ApplyChangesBtn
source: Apply changes
ru: Применить изменения

# DateErrorEnd
source: The end date should be later than the start date
ru: Время окончания должно быть позже времени начала.

# DateErrorStart
source: The start date should be earlier than the end date
ru: Время начала должно быть раньше, чем время окончания.

# DBBatchQtyReportView
source: Batch Qty
ru: Размер партии

# DBCommentDefectView
source: Comment
ru: Комментарий

# DBDefectCodeDefectView
source: Defect Code
ru: Код дефекта

# DBEndDateReportView
source: End Date
ru: Время окончания

# DBErrorDefectView
source: Error Type
ru: Тип дефекта

# DBErrorFieldDefectsView
source: [ErrorType (ENG)]
ru: [ErrorType (RUS)]

# DBInspectionTypeReportView
source: Inspection Type
ru: Тип контроля

# DBInspectorIDReportView
source: Inspector ID
ru: ID инспектора

# DBInspectorNameReportView
source: Inspector Name
ru: Имя инспектора

# DBInspFieldDefectsView
source: [InspectionType (ENG)]
ru: [InspectionType (RUS)]

# DBNameColumn
source: Name_ENG
ru: Name_RUS

# DBProdOrderReportView
source: Production Order
ru: Заказ

# DBProductReportView
source: Product Code
ru: Код продукта

# DBQtyCheckedReportView
source: Qty Checked
ru: Проверенное кол-во

# DBQtyDefectiveReportView
source: Qty Defective
ru: Кол-во дефектных

# DBReferenceDefectView
source: Reference
ru: Ссылка на компонент

# DBReportIDReportView
source: Report ID
ru: Номер отчёта

# DBStartDateReportView
source: Start Date
ru: Время начала

# DBStepDefectView
source: Manufacturing Step
ru: Стадия производства

# DBStepFieldDefectsView
source: [ManufacturingStep (ENG)]
ru: [ManufacturingStep (RUS)]

# DefectCountLbl
source: Defects registered:
ru: Зарегистрировано дефектов:

# DefectViewerCol1
source: Index
ru: № п/п

# DefectViewerCol2
source: Manufacturing Step
ru: Стадия производства

# DefectViewerCol3
source: Error Type
ru: Тип дефекта

# DefectViewerCol4
source: Defect Code
ru: Код дефекта

# DefectViewerCol5
source: Reference
ru: Ссылка на компонент

# DefectViewerCol6
source: Comment
ru: Комментарий

# DeleteReportConf
source: The report will be deleted from the database and it will not be possible to undo this action.
ru: Отчёт будет удален из базы данных и невозможно отменить это действие

# DeleteReportErr
source: Error during report deletion
ru: Ошибка при удалении отчета

# EditButton
source: Edit
ru: Редактировать

# EndDateFilter
source: End Date
ru: Время окончания

# EnterEditModeBtn
source: Enter Edit Mode
ru: Редактировать

# ExitEditModeBtn
source: Exit Edit Mode
ru: Выйти из режима редактирования

# HeaderEditTitle
source: Inspection Data - Report
ru: Данные проверки - Отчёт

source: No Date Filter
ru: Без фильтра даты

# NoDefectLbl
source: Defects registered: 0
ru: Зарегистрировано дефектов: 0

# NoDefectSelectedErr
source: No defect selected
ru: Ни один дефект не выбран

# NoOrderErr
source: No orders found for the product
ru: Не найдено ни одного заказа на продукт

# NoProductSelectedErr
source: Please fill in the product code before looking for orders
ru: Заполните код продукта, прежде чем искать заказы

# NoRowSelectedErr
source: No row selected. Please select an row
ru: Ни одна строка не выбрана. Выберите строку

# OrderForm
source: Orders
ru: Заказы

# RemoveAllDefectConf
source: All the defects will be removed and it will not be possible to undo this action.
ru: Все дефекты будут удалены, и будет невозможно отменить это действие

# SendDataConf
source: The data will be send to the Database. Please validate the data and press "Confirm" if everything is OK.
ru: Данные будут отправлены в базу данных. Проверьте данные и нажмите «Продолжить», если все в порядке.

# SendDataErr
source: Error during report insertion
ru: Ошибка при вставке отчета

# StartDateFilter
source: Start Date
ru: Время начала
